{
  "lecture": "Lecture 16",
  "models": {
    "OpenGVLab__InternVL3-14B": {
      "concepts": {
        "concepts": [],
        "evidence": [
          "Exponential Decay",
          "Amount of radioactive material A",
          "Time as a multiple of the halflife T"
        ]
      },
      "triples": {
        "triples": []
      }
    },
    "Qwen__Qwen2-VL-7B-Instruct": {
      "concepts": {
        "concepts": [],
        "evidence": [
          "Amount of radioactive material A compared to the original amount A0 or any quantity which is proportional to A.",
          "Exponential Decay"
        ]
      },
      "triples": {
        "triples": []
      }
    },
    "Qwen__Qwen3-VL-4B-Instruct": {
      "concepts": {
        "concepts": [],
        "evidence": [
          "Exponential Decay",
          "Amount of radioactive material A compared to the original amount A₀ or any quantity which is proportional to A.",
          "Time as a multiple of the halflife T"
        ]
      },
      "triples": {
        "triples": []
      }
    },
    "llava-hf__llava-onevision-qwen2-7b-ov-hf": {
      "concepts": {
        "concepts": [],
        "evidence": [
          "The reconstruction process is crucial in medical imaging to obtain accurate images from raw data.",
          "Image quality is a critical factor in determining the reliability of medical imaging results.",
          "Signal processing techniques are used to enhance and analyze the signals obtained from medical imaging modalities.",
          "The frequency domain is essential for understanding the spectral properties of signals in medical imaging.",
          "Anatomical knowledge is necessary for interpreting medical imaging results accurately."
        ]
      },
      "triples": {
        "triples": []
      }
    }
  },
  "paths": {
    "image": "G:\\My Drive\\1. Studies\\RPI\\Thesis\\1. Prof Ge Wang\\1. Avatar Project\\Future Directions\\Comparing Models\\Lectures\\Retrieved Data\\Further Work\\MILU23\\Lecture 16\\Images\\Slide25.JPG",
    "text": "G:\\My Drive\\1. Studies\\RPI\\Thesis\\1. Prof Ge Wang\\1. Avatar Project\\Future Directions\\Comparing Models\\Lectures\\Retrieved Data\\Further Work\\MILU23\\Lecture 16\\Texts\\Slide25.txt"
  },
  "slide_id": "Slide25"
}
