{
  "lecture": "Lecture 11",
  "models": {
    "OpenGVLab__InternVL3-14B": {
      "concepts": {
        "concepts": [
          {
            "category": "algorithm",
            "term": "model observer"
          },
          {
            "category": "mathematics",
            "term": "statistical decision theory"
          },
          {
            "category": "algorithm",
            "term": "Hotelling observer"
          },
          {
            "category": "ai_ml",
            "term": "machine learning"
          },
          {
            "category": "ai_ml",
            "term": "neural networks"
          }
        ],
        "evidence": [
          "A model observer is essentially a mathematical framework or a computational algorithm that simulates the way a human might read an image and make a decision.",
          "they describe how these observers can be based on rigorous statistical decision theory",
          "introducing you to some of the key types of model observers, starting from the ideal observer, and then moving toward more practical approximations like the Hotelling observer",
          "modern approaches involving machine learning and neural networks"
        ]
      },
      "triples": {
        "confidence": 1.0,
        "evidence": [
          "how they can be tailored to mimic human visual performance"
        ],
        "modalities": [
          "text"
        ],
        "o": "human visual performance",
        "p": "measures",
        "s": "model observers"
      }
    },
    "Qwen__Qwen2-VL-7B-Instruct": {
      "concepts": null,
      "triples": {
        "triples": []
      }
    },
    "Qwen__Qwen3-VL-4B-Instruct": {
      "concepts": {
        "category": "ai_ml",
        "term": "machine learning"
      },
      "triples": {
        "confidence": 0.85,
        "evidence": [
          "In this review paper by Xin He and Subok Park from the FDA, the authors summarize the foundations of model observers in medical imaging research. They describe how these observers can be based on rigorous statistical decision theory..."
        ],
        "modalities": [
          "text"
        ],
        "o": "rigorous statistical decision theory",
        "p": "uses",
        "s": "model observers"
      }
    },
    "llava-hf__llava-onevision-qwen2-7b-ov-hf": {
      "concepts": {
        "concepts": [
          {
            "category": "software",
            "term": "model observer"
          },
          {
            "category": "software",
            "term": "ideal observer"
          },
          {
            "category": "software",
            "term": "Hotelling observer"
          },
          {
            "category": "ai_ml",
            "term": "machine learning"
          },
          {
            "category": "ai_ml",
            "term": "neural networks"
          }
        ],
        "evidence": [
          "This brings us to the concept of model observers. A model observer is essentially a mathematical framework or a computational algorithm that simulates the way a human might read an image and make a decision.",
          "In this review paper by Xin He and Subok Park from the FDA, the authors summarize the foundations of model observers in medical imaging research. They describe how these observers can be based on rigorous statistical decision theory, how they can be tailored to mimic human visual performance, and how they’re applied in practice - from system optimization to regulatory science."
        ]
      },
      "triples": {
        "triples": []
      }
    }
  },
  "paths": {
    "image": "G:\\My Drive\\1. Studies\\RPI\\Thesis\\1. Prof Ge Wang\\1. Avatar Project\\Future Directions\\Comparing Models\\Lectures\\Retrieved Data\\Further Work\\MILU23\\Lecture 11\\Images\\Slide52.JPG",
    "text": "G:\\My Drive\\1. Studies\\RPI\\Thesis\\1. Prof Ge Wang\\1. Avatar Project\\Future Directions\\Comparing Models\\Lectures\\Retrieved Data\\Further Work\\MILU23\\Lecture 11\\Texts\\Slide52.txt"
  },
  "slide_id": "Slide52"
}
